--Заполнение таблиц

INSERT Salespeople (snum, sname, city, comm)
VALUES
(1002, 'Serres', 'San Jose', 0.13),
(1007, 'Rifkin', 'Barcelona', 0.15),
(1001, 'Peel', 'London', 0.12),
(1004, 'Monika', 'London', 0.11),
(1003, 'Axelrod', 'New York', 0.1);

INSERT Customers (cnum, cname, city, rating, snum)
VALUES
(2001, 'Hoffman', 'London', 100, 1001),
(2002, 'Giovanni', 'Rome', 200, 1003),
(2003, 'Liu', 'San Jose', 200, 1002),
(2004, 'Grass', 'Berlin', 300, 1002),
(2006, 'Clemens', 'London', 100, 1001),
(2007, 'Pereira', 'Rome', 100, 1004),
(2008, 'Cisneros', 'San Jose', 300, 1007);


INSERT Orders (onum, amt, odate, cnum, snum)
VALUES
(3001, 18.69, '2015-03-10', 2008, 1007),
(3007, 75.75, '2015-04-10', 2004, 1002),
(3003, 767.19, '2015-03-10', 2001, 1001),
(3006, 1098.16, '2015-03-10', 2008, 1007),
(3010, 1309.95, '2015-06-10', 2004, 1002),
(3009, 1713.25, '2015-04-10', 2002, 1003),
(3002, 1900.1, '2015-03-10', 2007, 1004),
(3008, 4723, '2015-05-10', 2006, 1001),
(3005, 5160.45, '2015-03-10', 2003, 1002),
(3011, 9891.88, '2015-06-10', 2006, 1001);